{"id":140,"date":"2022-06-08T15:10:31","date_gmt":"2022-06-08T15:10:31","guid":{"rendered":"https:\/\/autopartsstores.online\/workshops-can-remain-open-but-not-showrooms-agvs\/"},"modified":"2022-06-08T15:10:31","modified_gmt":"2022-06-08T15:10:31","slug":"workshops-can-remain-open-but-not-showrooms-agvs","status":"publish","type":"post","link":"https:\/\/autopartsstores.online\/workshops-can-remain-open-but-not-showrooms-agvs\/","title":{"rendered":"Workshops can remain open, but not showrooms |  AGVS"},"content":{"rendered":"<p><strong>March 17, 2020 upsa-agvs.ch – The implications for garages in Switzerland of the measures taken by the Confederation in the fight against the coronavirus crisis are now clear: workshops can continue to work, but personal sales in showrooms are suspended .<\/strong><\/p>\n<p>school  Today, the Federal Office of Public Health (FOPH) has regulated in detail the consequences of the measures aimed at shutting down public life for craft businesses in Switzerland.  Radical changes are also taking place for mechanics.  Let&#8217;s start with the good news: workshops can continue to work if they wish.<\/p>\n<p>In the &#8220;comments relating to ordinance 2 of March 13, 2020 on measures intended to combat the coronavirus (ordinance 2 COVID-19), status on March 16, 2020&#8243;*, the FOPH specifies which establishments are not closed during public: automobile and bicycle workshops are among them.<\/p>\n<p>In a second document containing frequently asked questions*, the FOPH writes that craft businesses can continue to work and that they are not subject to the obligation to close.  However, the stores of these companies accessible to the public must be closed.  This means that the showrooms of Swiss garages must be banned from now on and that the sale of vehicles is suspended for the time being.  Whether selling by phone or online is still possible is subject to clarification.<\/p>\n<p>The measures taken by the Confederation with the aim of slowing down the spread of the coronavirus are valid for the moment until April 19.<\/p>\n<p>(* The documents are not yet available in French. We are constantly on the FOPH website and will publish the documents on agvs-upsa.ch as soon as they are available in French translation.<br \/> \n<\/p>\n<h2 class=\"title_h2\">The SAD branch solution offers some advice to companies in their relations with customers:<\/h2>\n<ul class=\"number_list\">\n<li>The measures of the Confederation, the cantons and the FOPH must imperatively be respected.<\/li>\n<li>The health of customers and employees is the top priority.<\/li>\n<li>Keep calm and ensure that employees have the same information in accordance with the measures recommended by the Confederation, the FOPH and the cantons.<\/li>\n<li>Proactive management of communication on digital channels (e-mail, Skype, Messenger, etc.).<\/li>\n<li>Inform on the website that visits to the car workshop are always possible, restricted or prohibited (depending on the canton!), but that the urgency should be assessed beforehand.  Communication of telephone number and e-mail address for urgent interventions.<\/li>\n<li>Put up a sign at the entrance, give up shaking hands with employees and customers and keep your distance.<\/li>\n<li>Avoid cash payments.<\/li>\n<li>Disinfect steering wheels, door handles, gear levers, touch screens, fuel filler flaps, etc.  before handing over the vehicle.<\/li>\n<li>Use single-use steering wheel covers and disinfect your hands each time you change vehicles.<\/li>\n<li>Have disinfectant and hand cream at the entrance with the corresponding information.<\/li>\n<li>Take into account in the planning the difficulties of delivery for spare parts \/ vehicles.<\/li>\n<li>Reduce, if necessary, the available capacities of the workshop, because the absence of collaborators is to be expected.<\/li>\n<li>Check the calendar of events.<\/li>\n<li>For any urgent questions, the road traffic offices can also be reached by telephone \/ e-mail.  In-person visits to offices should be avoided.<\/li>\n<li>License plates and circulation permits can also be sent by post.<\/li>\n<li>After refueling, disinfect your hands, because the pump gun is a real breeding ground for bacteria and viruses!<\/li>\n<li>Important: as a PERCO, assume your responsibilities in the company and actively ensure that the instructions required by the FOPH are implemented.<\/li>\n<\/ul>\n<p><\/p>\n<p>to the top<\/p>\n","protected":false},"excerpt":{"rendered":"<p>March 17, 2020 upsa-agvs.ch – The implications for garages in Switzerland of the measures taken by the Confederation in the fight against the coronavirus crisis [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":141,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/posts\/140"}],"collection":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/comments?post=140"}],"version-history":[{"count":0,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/posts\/140\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/media\/141"}],"wp:attachment":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/media?parent=140"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/categories?post=140"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/tags?post=140"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}