{"id":188,"date":"2022-06-10T08:35:41","date_gmt":"2022-06-10T08:35:41","guid":{"rendered":"https:\/\/autopartsstores.online\/the-10-pillars-of-a-commercial-revolution\/"},"modified":"2022-06-10T08:35:41","modified_gmt":"2022-06-10T08:35:41","slug":"the-10-pillars-of-a-commercial-revolution","status":"publish","type":"post","link":"https:\/\/autopartsstores.online\/the-10-pillars-of-a-commercial-revolution\/","title":{"rendered":"The 10 pillars of a commercial revolution"},"content":{"rendered":"<p>We were waiting for the breakthrough of e-commerce in food distribution and it is “d-commerce”, one of these avatars, which is exploding.  D for “drive(s)”, these warehouse stores where you load groceries into the trunk of your car after ordering them on the internet.  They are springing up like mushrooms, usually attached to existing stores.  As an acknowledgment of the failure of the latter to offer their customers fast, practical and pleasant shopping.  But no matter, since you have to be.  They are also flourishing more and more at a distance from their &#8220;mother&#8221; store (back-to-back), even independently (solo).<\/p>\n<p>How many are they ?  Numbers vary.  Between 600 and 750. <i>LSA Atlas<\/i> there are nearly 700 of them. Nielsen estimates that, since the beginning of the year, about a hundred warehouses have been built, that is to say ten per month.  Leclerc alone says he inaugurates one or two a week and sees himself tomorrow &#8211; in less than ten years &#8211; at the head of a fleet of more than 1,000 warehouses.  1,000 is the symbolic milestone that this new format should reach next year, as the distribution staffs are so enthusiastic about this new format.  Not a press conference or a strategic point without mentioning the question of the development of drives, a format considered to be still marginal only two years ago.<\/p>\n<p>Yes, but since the graft has started to take hold, these new types of sales outlets have found an audience, customers.  More than one million French households (1.15) have chosen to have their coffers filled on the order recovery “tracks”.  Many mothers, people in a hurry, all tired of wasting hours filling their weekly carts.<\/p>\n<p>Forecasters are racing ahead of what must be called a new commercial revolution.  Kurt Salmon estimates the market at 4 billion euros in turnover from 2015, against barely 500 million in 2010, and 350 million in 2009&#8230; An extrapolation by Kantar, revealed by Casino, even figures the share of sales of consumer products that could be monopolized by distance shopping and, mainly, by drive within ten years, against 1% last year.  Essentially at the expense of hypermarkets.<\/p>\n<p>Consultant fantasy?  Nothing is less sure.  On the ground, even if the pioneers Auchan and Chronodrive still do not claim to be profitable, the economic model is furiously similar to the finest hours of modern commerce, when a hypermarket was profitable in a handful of years.  The return on investment of a beautiful back-to-back drive is achieved in just four years, with pre-tax profitability that can reach 5% of turnover, more than twice as much as a hypermarket!  All for a starting bet five to ten times lower than that of a supermarket, and a turnover that can climb up to 10 million euros.<\/p>\n<p>To decipher and understand this new format, the writing of <i>LSA <\/i>went to investigate in the field, looking at the 10 pillars on which this new model is based.  Everyone drive!<\/p>\n<blockquote class=\"encadreGauche\">\n<p class=\"titreType8\"><strong>THE PHENOMENON IN FIGURES<\/strong>&#13;\n<\/p>\n<ul>\n<li>1 to 1.5 billion € turnover in 2011, according to estimates <\/li>\n<p>&#13;<\/p>\n<li>1.15 million households used this circuit between June 2010 and June 2011 (Kantar) <\/li>\n<p>&#13;<\/p>\n<li>€63 average basket (Kantar) <\/li>\n<p>&#13;<\/p>\n<li>From €150,000 to €300,000 investment for a simple picking drive <\/li>\n<p>&#13;<\/p>\n<li>2 to 4 M€ of investment for a large back-to-back drive-thru warehouse <\/li>\n<p>&#13;<\/p>\n<li>From 2 and 10 M€ of turnover for adjoining drive <\/li>\n<p>&#13;<\/p>\n<li>At Leclerc, a withdrawal route generates €600,000 in turnover per year on average <\/li>\n<p>&#13;<\/p>\n<li>From 1,200 to 2,000 m² of surface area for drive-through warehouse <\/li>\n<p>&#13;<\/p>\n<li>5% net profitability before tax for a drive-thru warehouse <\/li>\n<p>&#13;\n<\/ul>\n<p>Source: LSA, based on distributors<\/p>\n<p>&#13;\n<\/p><\/blockquote>\n<p> <\/p>\n","protected":false},"excerpt":{"rendered":"<p>We were waiting for the breakthrough of e-commerce in food distribution and it is “d-commerce”, one of these avatars, which is exploding. D for “drive(s)”, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":189,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/posts\/188"}],"collection":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/comments?post=188"}],"version-history":[{"count":0,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/posts\/188\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/media\/189"}],"wp:attachment":[{"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/media?parent=188"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/categories?post=188"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/autopartsstores.online\/wp-json\/wp\/v2\/tags?post=188"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}